In [1]:
import numpy as np
import pandas as pd

In [2]:
data = np.random.randn(4,3)

In [4]:
dataFrame = pd.DataFrame(data)

In [5]:
dataFrame

          0         1         2
0  0.961718 -1.474556  1.257537
1  0.422426  0.007096  0.275967
2 -0.136237  0.522699 -0.717082
3  0.540900  0.342868  0.852537

In [6]:
yeniDataFrame = pd.DataFrame(data, index = ["furkan","ali","mehmet","can"], columns = ["maas","yas","yil"])

In [7]:
yeniDataFrame

            maas       yas       yil
furkan  0.961718 -1.474556  1.257537
ali     0.422426  0.007096  0.275967
mehmet -0.136237  0.522699 -0.717082
can     0.540900  0.342868  0.852537

In [8]:
yeniDataFrame["yas"]

furkan   -1.474556
ali       0.007096
mehmet    0.522699
can       0.342868
Name: yas, dtype: float64

In [9]:
yeniDataFrame[["maas","yil"]]

            maas       yil
furkan  0.961718  1.257537
ali     0.422426  0.275967
mehmet -0.136237 -0.717082
can     0.540900  0.852537

In [13]:
yeniDataFrame.loc["furkan"] #satir olarak cagirmak

maas    0.961718
yas    -1.474556
yil     1.257537
Name: furkan, dtype: float64

In [12]:
yeniDataFrame.iloc[0] # index tabanli location

maas    0.961718
yas    -1.474556
yil     1.257537
Name: furkan, dtype: float64

In [16]:
yeniDataFrame["emeklilik yasi"] = yeniDataFrame["yas"] + yeniDataFrame["yas"] # yeni kolon ekleme

In [17]:
yeniDataFrame

            maas       yas       yil  emeklilik yasi
furkan  0.961718 -1.474556  1.257537       -2.949111
ali     0.422426  0.007096  0.275967        0.014192
mehmet -0.136237  0.522699 -0.717082        1.045398
can     0.540900  0.342868  0.852537        0.685736

In [20]:
yeniDataFrame.drop("emeklilik yasi", axis=1) # axis =1 column axis=0 row icin, drop silmek icin kullanilir

            maas       yas       yil
furkan  0.961718 -1.474556  1.257537
ali     0.422426  0.007096  0.275967
mehmet -0.136237  0.522699 -0.717082
can     0.540900  0.342868  0.852537

In [22]:
yeniDataFrame # ana framede silinmedi ama

            maas       yas       yil  emeklilik yasi
furkan  0.961718 -1.474556  1.257537       -2.949111
ali     0.422426  0.007096  0.275967        0.014192
mehmet -0.136237  0.522699 -0.717082        1.045398
can     0.540900  0.342868  0.852537        0.685736

In [23]:
yeniDataFrame.drop("emeklilik yasi", axis=1, inplace=True) # gercekten silmek istiyorsak inplace true vermemiz gerekir

In [24]:
yeniDataFrame

            maas       yas       yil
furkan  0.961718 -1.474556  1.257537
ali     0.422426  0.007096  0.275967
mehmet -0.136237  0.522699 -0.717082
can     0.540900  0.342868  0.852537

In [25]:
yeniDataFrame.loc["furkan"]["maas"]

0.9617177013838368

In [28]:
yeniDataFrame.loc["furkan","yas"] # bu sekildede cagirabiliriz

-1.4745555198269613

In [29]:
yeniDataFrame > 0

         maas    yas    yil
furkan   True  False   True
ali      True   True   True
mehmet  False   True  False
can      True   True   True

In [30]:
boolenFrame = yeniDataFrame > 0

In [31]:
yeniDataFrame[boolenFrame]

            maas       yas       yil
furkan  0.961718       NaN  1.257537
ali     0.422426  0.007096  0.275967
mehmet       NaN  0.522699       NaN
can     0.540900  0.342868  0.852537

In [32]:
yeniDataFrame["yas"] > 0

furkan    False
ali        True
mehmet     True
can        True
Name: yas, dtype: bool

In [34]:
yeniDataFrame[yeniDataFrame["yas"] > 0] # sadece yasi buyuk olanlari getir

            maas       yas       yil
ali     0.422426  0.007096  0.275967
mehmet -0.136237  0.522699 -0.717082
can     0.540900  0.342868  0.852537

In [36]:
yeniDataFrame.reset_index() # indexleri resetlemek istersek

    index      maas       yas       yil
0  furkan  0.961718 -1.474556  1.257537
1     ali  0.422426  0.007096  0.275967
2  mehmet -0.136237  0.522699 -0.717082
3     can  0.540900  0.342868  0.852537

In [37]:
yeniIndexList = ["f","a","m","c"]

In [38]:
yeniDataFrame["Yeni Index"] = yeniIndexList

In [39]:
yeniDataFrame

            maas       yas       yil Yeni Index
furkan  0.961718 -1.474556  1.257537          f
ali     0.422426  0.007096  0.275967          a
mehmet -0.136237  0.522699 -0.717082          m
can     0.540900  0.342868  0.852537          c

In [43]:
yeniDataFrame.set_index("Yeni Index") # indexleri degistirmek istersek, inplace ile kalici yapabiliriz

                maas       yas       yil
Yeni Index
f           0.961718 -1.474556  1.257537
a           0.422426  0.007096  0.275967
m          -0.136237  0.522699 -0.717082
c           0.540900  0.342868  0.852537

## multi indexler

In [44]:
ilkIndexler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [45]:
icIndexler = ["Homer","Bart","Marge","Cartman","Kylie","Kenny"]

In [46]:
birlesmisIndex = list(zip(ilkIndexler,icIndexler))

In [47]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kylie'),
 ('South Park', 'Kenny')]

In [48]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [49]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kylie'),
            ('South Park',   'Kenny')],
           )

In [50]:
cizgiFilmListem = [[40,"A"],[50,"B"],[45,"C"],[25,"D"],[35,"E"],[30,"F"]]

In [53]:
cizgiFilmNumpyDizi = np.array(cizgiFilmListem)

In [54]:
cizgiFilmNumpyDizi

array([['40', 'A'],
       ['50', 'B'],
       ['45', 'C'],
       ['25', 'D'],
       ['35', 'E'],
       ['30', 'F']], dtype='<U11')

In [55]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizi,index=birlesmisIndex,columns=["yas","meslek"])

In [56]:
cizgiFilmDataFrame

                   yas meslek
Simpson    Homer    40      A
           Bart     50      B
           Marge    45      C
South Park Cartman  25      D
           Kylie    35      E
           Kenny    30      F

In [57]:
cizgiFilmDataFrame.loc["Simpson"]

      yas meslek
Homer  40      A
Bart   50      B
Marge  45      C

In [58]:
cizgiFilmDataFrame.loc["South Park"].loc["Kylie"]

yas       35
meslek     E
Name: Kylie, dtype: object

In [59]:
cizgiFilmDataFrame.index.names = ["Aile","Ad"]

In [60]:
cizgiFilmDataFrame

                   yas meslek
Aile       Ad
Simpson    Homer    40      A
           Bart     50      B
           Marge    45      C
South Park Cartman  25      D
           Kylie    35      E
           Kenny    30      F

## Eksik Veriler

In [61]:
sozlukVeri = {"Istanbul":[10,np.nan,13],"Ankara":[15,18,np.nan],"Izmir":[19,18,21],"Antalya":[21,np.nan,np.nan]}

In [62]:
sozlukDataFrame = pd.DataFrame(sozlukVeri)

In [63]:
sozlukDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      10.0    15.0     19     21.0
1       NaN    18.0     18      NaN
2      13.0     NaN     21      NaN

In [64]:
sozlukDataFrame.dropna() # satirlarda nan olanlari sil

   Istanbul  Ankara  Izmir  Antalya
0      10.0    15.0     19     21.0

In [66]:
sozlukDataFrame.dropna(axis=1) #sutunlarda nan olanlari sil

   Izmir
0     19
1     18
2     21

In [69]:
sozlukDataFrame.dropna(axis=1, thresh=2) # 1den fazla nan varsa gosterme

   Istanbul  Ankara  Izmir
0      10.0    15.0     19
1       NaN    18.0     18
2      13.0     NaN     21

In [71]:
sozlukDataFrame.fillna(15) # nan olanlari 15 ile degistir

   Istanbul  Ankara  Izmir  Antalya
0      10.0    15.0     19     21.0
1      15.0    18.0     18     15.0
2      13.0    15.0     21     15.0

## groupby ile gruplandirmak

In [83]:
maasSozluk = {"Departman":["yazilim","satis","yazilim","finans","finans","satis"],
             "Calisanlar":["ahmet","mehmet","zeynep","can","furkan","ada"],
             "Maas":[100,200,300,400,500,600]}

In [84]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [85]:
maasDataFrame

  Departman Calisanlar  Maas
0   yazilim      ahmet   100
1     satis     mehmet   200
2   yazilim     zeynep   300
3    finans        can   400
4    finans     furkan   500
5     satis        ada   600

In [86]:
grupObjesi = maasDataFrame.groupby("Departman")

In [87]:
grupObjesi.count() # hangi departmanda kac kisi calisiyor

           Calisanlar  Maas
Departman
finans              2     2
satis               2     2
yazilim             2     2

In [88]:
grupObjesi.mean() # ortalama maaslari

           Maas
Departman
finans      450
satis       400
yazilim     200

In [89]:
grupObjesi.min() # min maas alanlar

          Calisanlar  Maas
Departman
finans           can   400
satis            ada   200
yazilim        ahmet   100

In [91]:
grupObjesi.max() # max maas alanlar

          Calisanlar  Maas
Departman
finans        furkan   500
satis         mehmet   600
yazilim       zeynep   300

In [93]:
grupObjesi.describe() # herseyi hesaplar

           Maas
          count   mean         std    min    25%    50%    75%    max
Departman
finans      2.0  450.0   70.710678  400.0  425.0  450.0  475.0  500.0
satis       2.0  400.0  282.842712  200.0  300.0  400.0  500.0  600.0
yazilim     2.0  200.0  141.421356  100.0  150.0  200.0  250.0  300.0

## Concat

In [94]:
sozluk1 = {"Ad":["Ahmet","Mehmet","Zeynep","Furkan"], "Spor":["Kosu","Yuzme","Kosu","Basketbol"],"Kalori":[100,200,300,400]}

In [95]:
dataFrame1 = pd.DataFrame(sozluk1)

In [97]:
dataFrame1

       Ad       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     300
3  Furkan  Basketbol     400

In [98]:
sozluk2 = {"Ad":["Ali","veli","ayse","hasan"], "Spor":["Kosu","Yuzme","Kosu","Basketbol"],"Kalori":[100,500,300,250]}

In [99]:
dataFrame2 = pd.DataFrame(sozluk2, index=[4,5,6,7])

In [100]:
dataFrame2

      Ad       Spor  Kalori
4    Ali       Kosu     100
5   veli      Yuzme     500
6   ayse       Kosu     300
7  hasan  Basketbol     250

In [109]:
sozluk3 = {"Ad":["Faruk","Nihat","Mithat","Polat"], "Spor":["Kosu","Futbol","Kosu","Basketbol"],"Kalori":[300,400,300,400]}

In [112]:
dataFrame3 = pd.DataFrame(sozluk3, index=[8,9,10,11])

In [113]:
dataFrame3

        Ad       Spor  Kalori
8    Faruk       Kosu     300
9    Nihat     Futbol     400
10  Mithat       Kosu     300
11   Polat  Basketbol     400

In [118]:
toplamDataFrame = pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0) # tum dataframeleri birlestirdik

In [119]:
toplamDataFrame

        Ad       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yuzme     200
2   Zeynep       Kosu     300
3   Furkan  Basketbol     400
4      Ali       Kosu     100
5     veli      Yuzme     500
6     ayse       Kosu     300
7    hasan  Basketbol     250
8    Faruk       Kosu     300
9    Nihat     Futbol     400
10  Mithat       Kosu     300
11   Polat  Basketbol     400

## merge

In [120]:
sporSozluk = {"Ad":["furkan","halil","ismail"],"spor":["kosu","yuzme","futbol"]}

In [126]:
kaloriSozluk = {"Ad":["furkan","halil","ismail"],"kalori":[300,200,350]}

In [127]:
sporDataFrame = pd.DataFrame(sporSozluk)

In [128]:
kaloriDataFrame = pd.DataFrame(kaloriSozluk)

In [129]:
pd.merge(sporDataFrame,kaloriDataFrame, on="Ad") # ad kolonu uzerinden islem yap dedik bunu ortak kolon olarak belirledik yani

       Ad    spor  kalori
0  furkan    kosu     300
1   halil   yuzme     200
2  ismail  futbol     350

## ileri operasyonlar

In [132]:
maaslarData = {"Ad":["ali","ahmet","atil","anil"],
            "maas":[100,200,300,400],
              "Departman":["yazilim","satis","pazarlama","yazilim"]}

In [133]:
maaslarDataFrame = pd.DataFrame(maaslarData)

In [134]:
maaslarDataFrame

      Ad  maas  Departman
0    ali   100    yazilim
1  ahmet   200      satis
2   atil   300  pazarlama
3   anil   400    yazilim

In [135]:
maaslarDataFrame["Departman"].unique()

array(['yazilim', 'satis', 'pazarlama'], dtype=object)

In [136]:
maaslarDataFrame["Departman"].nunique() # boylece kac farkli departman var bunun bilgisini alabiliyoruz

3

In [139]:
maaslarDataFrame["Departman"].value_counts() # her departmandan kac tane var

yazilim      2
pazarlama    1
satis        1
Name: Departman, dtype: int64

In [143]:
def bruttenNete(maas):
    return maas*0.66

In [144]:
maaslarDataFrame["maas"].apply(bruttenNete)# bu sekilde fonksiyonlari oldukca kolay bir sekilde uygulayabiliriz

0     66.0
1    132.0
2    198.0
3    264.0
Name: maas, dtype: float64

In [146]:
maaslarDataFrame.isnull() # nan deger varmi bakmak icin

      Ad   maas  Departman
0  False  False      False
1  False  False      False
2  False  False      False
3  False  False      False